```google_compute_network.vcp: Refreshing state... [id=projects/kubepractices/global/networks/k8s-network]
google_compute_firewall.k8s_controlnode_rule: Refreshing state... [id=projects/kubepractices/global/firewalls/k8s-controlnode-rule]
google_compute_firewall.k8s_workernode_rule: Refreshing state... [id=projects/kubepractices/global/firewalls/k8s-workernode-rule]
google_compute_firewall.default: Refreshing state... [id=projects/kubepractices/global/firewalls/default]
google_compute_instance.controlnode[0]: Refreshing state... [id=projects/kubepractices/zones/europe-west4-a/instances/controlnode-0]
google_compute_instance.workernode[0]: Refreshing state... [id=projects/kubepractices/zones/europe-west4-a/instances/workernode-0]
google_compute_instance.workernode[2]: Refreshing state... [id=projects/kubepractices/zones/europe-west4-a/instances/workernode-2]
google_compute_instance.workernode[1]: Refreshing state... [id=projects/kubepractices/zones/europe-west4-a/instances/workernode-1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_compute_firewall.default has been changed
  ~ resource "google_compute_firewall" "default" {
        id                      = "projects/kubepractices/global/firewalls/default"
        name                    = "default"
      + source_service_accounts = []
      + source_tags             = []
      + target_service_accounts = []
      + target_tags             = []
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }
  # google_compute_firewall.k8s_controlnode_rule has been changed
  ~ resource "google_compute_firewall" "k8s_controlnode_rule" {
        id                      = "projects/kubepractices/global/firewalls/k8s-controlnode-rule"
        name                    = "k8s-controlnode-rule"
      + source_service_accounts = []
      + source_tags             = []
      + target_service_accounts = []
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # google_compute_firewall.k8s_workernode_rule has been changed
  ~ resource "google_compute_firewall" "k8s_workernode_rule" {
        id                      = "projects/kubepractices/global/firewalls/k8s-workernode-rule"
        name                    = "k8s-workernode-rule"
      + source_service_accounts = []
      + source_tags             = []
      + target_service_accounts = []
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # google_compute_instance.controlnode[0] has been changed
  ~ resource "google_compute_instance" "controlnode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/controlnode-0"
      + labels               = {}
      + metadata             = {}
        name                 = "controlnode-0"
      + resource_policies    = []
        tags                 = [
            "controlnode",
        ]
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # google_compute_instance.workernode[0] has been changed
  ~ resource "google_compute_instance" "workernode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-0"
      + labels               = {}
      + metadata             = {}
        name                 = "workernode-0"
      + resource_policies    = []
        tags                 = [
            "workernode",
        ]
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # google_compute_instance.workernode[1] has been changed
  ~ resource "google_compute_instance" "workernode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-1"
      + labels               = {}
      + metadata             = {}
        name                 = "workernode-1"
      + resource_policies    = []
        tags                 = [
            "workernode",
        ]
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # google_compute_instance.workernode[2] has been changed
  ~ resource "google_compute_instance" "workernode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-2"
      + labels               = {}
      + metadata             = {}
        name                 = "workernode-2"
      + resource_policies    = []
        tags                 = [
            "workernode",
        ]
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.controlnode[0] must be replaced
-/+ resource "google_compute_instance" "controlnode" {
      ~ cpu_platform         = "Intel Skylake" -> (known after apply)
      ~ current_status       = "RUNNING" -> (known after apply)
      - enable_display       = false -> null
      ~ guest_accelerator    = [] -> (known after apply)
      ~ id                   = "projects/kubepractices/zones/europe-west4-a/instances/controlnode-0" -> (known after apply)
      ~ instance_id          = "3161834478445380560" -> (known after apply)
      ~ label_fingerprint    = "42WmSpB8rSM=" -> (known after apply)
      - labels               = {} -> null
      - metadata             = {} -> null
      ~ metadata_fingerprint = "Kbvq5OfHefk=" -> (known after apply)
      + min_cpu_platform     = (known after apply)
        name                 = "controlnode-0"
      ~ project              = "kubepractices" -> (known after apply)
      - resource_policies    = [] -> null
      ~ self_link            = "https://www.googleapis.com/compute/v1/projects/kubepractices/zones/europe-west4-a/instances/controlnode-0" -> (known after apply)
        tags                 = [
            "controlnode",
        ]
      ~ tags_fingerprint     = "ttzrPdFbGN4=" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/kubepractices/zones/europe-west4-a/disks/controlnode-0" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20210721" -> "ubuntu-os-cloud/ubuntu-2104" # forces replacement
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/kubepractices/global/networks/k8s-network" -> "k8s-network"
          ~ network_ip         = "10.164.0.3" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/kubepractices/regions/europe-west4/subnetworks/k8s-network" -> (known after apply)
          ~ subnetwork_project = "kubepractices" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "34.91.225.236" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ min_node_cpus       = 0 -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.workernode[0] must be replaced
-/+ resource "google_compute_instance" "workernode" {
      ~ cpu_platform         = "Intel Skylake" -> (known after apply)
      ~ current_status       = "RUNNING" -> (known after apply)
      - enable_display       = false -> null
      ~ guest_accelerator    = [] -> (known after apply)
      ~ id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-0" -> (known after apply)
      ~ instance_id          = "2883648961352156113" -> (known after apply)
      ~ label_fingerprint    = "42WmSpB8rSM=" -> (known after apply)
      - labels               = {} -> null
      - metadata             = {} -> null
      ~ metadata_fingerprint = "Kbvq5OfHefk=" -> (known after apply)
      + min_cpu_platform     = (known after apply)
        name                 = "workernode-0"
      ~ project              = "kubepractices" -> (known after apply)
      - resource_policies    = [] -> null
      ~ self_link            = "https://www.googleapis.com/compute/v1/projects/kubepractices/zones/europe-west4-a/instances/workernode-0" -> (known after apply)
        tags                 = [
            "workernode",
        ]
      ~ tags_fingerprint     = "JQFYQJeWzLU=" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/kubepractices/zones/europe-west4-a/disks/workernode-0" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20210721" -> "ubuntu-os-cloud/ubuntu-2104" # forces replacement
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/kubepractices/global/networks/k8s-network" -> "k8s-network"
          ~ network_ip         = "10.164.0.5" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/kubepractices/regions/europe-west4/subnetworks/k8s-network" -> (known after apply)
          ~ subnetwork_project = "kubepractices" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "34.90.174.88" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ min_node_cpus       = 0 -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.workernode[1] must be replaced
-/+ resource "google_compute_instance" "workernode" {
      ~ cpu_platform         = "Intel Skylake" -> (known after apply)
      ~ current_status       = "RUNNING" -> (known after apply)
      - enable_display       = false -> null
      ~ guest_accelerator    = [] -> (known after apply)
      ~ id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-1" -> (known after apply)
      ~ instance_id          = "3880266289546118097" -> (known after apply)
      ~ label_fingerprint    = "42WmSpB8rSM=" -> (known after apply)
      - labels               = {} -> null
      - metadata             = {} -> null
      ~ metadata_fingerprint = "Kbvq5OfHefk=" -> (known after apply)
      + min_cpu_platform     = (known after apply)
        name                 = "workernode-1"
      ~ project              = "kubepractices" -> (known after apply)
      - resource_policies    = [] -> null
      ~ self_link            = "https://www.googleapis.com/compute/v1/projects/kubepractices/zones/europe-west4-a/instances/workernode-1" -> (known after apply)
        tags                 = [
            "workernode",
        ]
      ~ tags_fingerprint     = "JQFYQJeWzLU=" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/kubepractices/zones/europe-west4-a/disks/workernode-1" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20210721" -> "ubuntu-os-cloud/ubuntu-2104" # forces replacement
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/kubepractices/global/networks/k8s-network" -> "k8s-network"
          ~ network_ip         = "10.164.0.4" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/kubepractices/regions/europe-west4/subnetworks/k8s-network" -> (known after apply)
          ~ subnetwork_project = "kubepractices" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "34.141.197.14" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ min_node_cpus       = 0 -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.workernode[2] must be replaced
-/+ resource "google_compute_instance" "workernode" {
      ~ cpu_platform         = "Intel Skylake" -> (known after apply)
      ~ current_status       = "RUNNING" -> (known after apply)
      - enable_display       = false -> null
      ~ guest_accelerator    = [] -> (known after apply)
      ~ id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-2" -> (known after apply)
      ~ instance_id          = "8754103604049200081" -> (known after apply)
      ~ label_fingerprint    = "42WmSpB8rSM=" -> (known after apply)
      - labels               = {} -> null
      - metadata             = {} -> null
      ~ metadata_fingerprint = "Kbvq5OfHefk=" -> (known after apply)
      + min_cpu_platform     = (known after apply)
        name                 = "workernode-2"
      ~ project              = "kubepractices" -> (known after apply)
      - resource_policies    = [] -> null
      ~ self_link            = "https://www.googleapis.com/compute/v1/projects/kubepractices/zones/europe-west4-a/instances/workernode-2" -> (known after apply)
        tags                 = [
            "workernode",
        ]
      ~ tags_fingerprint     = "JQFYQJeWzLU=" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/kubepractices/zones/europe-west4-a/disks/workernode-2" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20210721" -> "ubuntu-os-cloud/ubuntu-2104" # forces replacement
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/kubepractices/global/networks/k8s-network" -> "k8s-network"
          ~ network_ip         = "10.164.0.2" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/kubepractices/regions/europe-west4/subnetworks/k8s-network" -> (known after apply)
          ~ subnetwork_project = "kubepractices" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "35.204.74.166" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ min_node_cpus       = 0 -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```